[{"review_id":"nJTSr-EGNhhA5o146THkPg","user_id":"T9O5pkKKlNvr-qqfefDlbA","business_id":"luOZQ9YBrWwP8mYrS4rNoA","stars":4.0,"useful":2,"funny":0,"cool":0,"text":"This place has some of the BEST chinese take-out in Portland. Don't let the inside-a-bar vibe scare you away. WE LOVE HAPPY FORTUNE. Just thinking about it makes me want to go there right now. Plus.. they have great prices. \n\nHere's some of our favorites over the years: General Tso's (nice and spicy), the crab puffs, lo-mein. \n\nThe service is great -- cheap drinks, while you're waiting, from plucky, yet-very-nice bartenders. Interesting people watching, but make sure to order from the bar-side of the place for that.","date":"2008-12-03 04:39:26"},
{"review_id":"ADPWjsySIpmuOSL07w7kSQ","user_id":"_soZ9DRjCF7Op7Us8bxSSA","business_id":"p2BkIrOuIsxGqtV0lwOZUw","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Just had Yalla for lunch today. I work on Krog Street, so figured I would give it a shot today. The line was VERY Long (about 10 people deep), which must mean it is good. I waited, and waited, and waited in line for about 20 minutes. My co-workers went to Fred's and had ordered and almost finished their food by the time I sat down at a table. I stuck it out in line though. The people behind the counter are very slow. Maybe because they have only been open for three weeks they are still working on the process. There is room for improvement on \"moving orders through the line.\"\n\nIt's basically like a burrito place, but Mediterranean food. I got the pita Shawarma ($8) which was a little pricey considering this was their smallest size. One size up is basically a Mediterranean tortilla which was $14. That is VERY steep vs a burrito place being about $6.50 or $7.\n\nThey did a great job loading it up though with lots of sauces and vegis. Food wise, I would give them a 4 as everything tasted great. Service wise, I would have to give them a 2 as the wait was terrible! 20 minutes in line is crazy for only having about 10 people in line. Good food, but the prices are very high too.","date":"2014-12-17 19:34:52"},
{"review_id":"7_Guwplx7k3vn-gtqLNFdg","user_id":"XBS1K_IzAya1uGpJwTk4GQ","business_id":"AvXqLbcGCxdIEF_qZTY0Kw","stars":5.0,"useful":1,"funny":1,"cool":0,"text":"Overall Recommendation:  If you like fried chicken, you should definitely check this place out.  Be forewarned that it's not a nice restaurant like the Flying Biscuit or Mary Macs so adjust your expectations for decor and service.  My husband and I are not from the South but as we ate our way through Atlanta, the Busy Bee Cafe ranked #1 on both our lists.\n\nPros\n  - BEST FRIED CHICKEN WE'VE EVER HAD...perfectly crispy skin with \n    great flavor. It seriously makes me not very excited to eat fried chicken \n    anytime soon because I know anywhere I go in Boston won't be as \n    good.\n  - Ribs with a nice, smokey taste\n  - Super mac n' cheese made with real cheese\n  - Dang good corn muffins you can munch on before your food arrives.\n\nCons\n  - Very busy so be prepared to wait (and you should because it's worth it)\n  - No air conditioning so in the summer it can get pretty toasty.  We were \n    there at the end of June and even with the fans going, it was warm.\n  - Sweet tea is too sweet for me\n\n**Note: There's a small parking lot as well as street parking.  However if you park on the street, the meters are really expensive...something crazy like $2 an hour.","date":"2011-06-29 01:26:18"},
{"review_id":"HgseF4yuseUvcrmCJXZliA","user_id":"hcItyz0modqnxavedxxNBQ","business_id":"xPo2OA5_wQgUEzAr-1o1Lg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"best pizza on a busy street! my kids love it. i've been recommending to everyone who has a birthday party in that area to order from pizzapalooza and they are not disappointed. the pizza is thick, square and yummY! so many varieties, i love their pasta with meatball too! They also serve ice cream. This is a good value comfort food place for me and my family.","date":"2008-12-03 20:41:59"},
{"review_id":"vwPVD6AfV3Hi5F2bjKZK1w","user_id":"g-1DDTwuJArYg2ZHolRAOw","business_id":"vRrDTIW9IFBO4cc3laazUw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"So sad to learn they are demolishing this. Always loved coming here and seeing all the graffiti art work.","date":"2018-03-15 20:34:25"},
{"review_id":"KeyNH8Jj05BZGtqjgCFnTg","user_id":"M20pTzUOo2yD5Cuh5shjSA","business_id":"M4jkJHewQXZvDV34Tuon8g","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Had the worst experience there today when I tried to have a breakfast. The service was slow waited at least 30 min for my French toast and when it got there I pulled a long grosse hair out of it. I'm never going there again!","date":"2014-08-10 20:40:15"},
{"review_id":"yXKu-60gP_378PX0xzyHHg","user_id":"uUrXZ2guG27PQUeR6u8K3w","business_id":"WtDOs3a6k_oPJmwiDh4qBQ","stars":2.0,"useful":3,"funny":1,"cool":2,"text":"I wanted this to be a great place, but I wasn't impressed.  I went there for dinner on a Monday.  I tried the pulled pork sandwich--it seemed like a sort of specialty.  My husband had the burger.  The buns left something to be desired.  The fries were okay but a little cold.  But at about $10 per entree for bar food, it wasn't as good as it should have been.  Service was fine--they were overstaffed.  I don't think I will be back anytime soon.","date":"2009-02-28 22:47:35"},
{"review_id":"lJ7rzbvT-l8KO8lHfEsXsg","user_id":"LV1ME-ibA2h0IGyFUUWhaQ","business_id":"H_RM2u1WWGU1HkKZrYq2Ow","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Incredible donuts. Sometimes you have to go early to have the full selection but the donuts never disappoint.","date":"2017-08-07 19:34:13"},
{"review_id":"k_cSVNRR_VkRvoJvODhclg","user_id":"whAYipnvcovnm4CXYuo9cw","business_id":"zWp3VbtS1p6PEdOxImpL1A","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"New owner is raising the bar with designer womens clothing.","date":"2013-12-31 16:53:20"},
{"review_id":"Lyjp1HlZbV7w7DLfXO-RiQ","user_id":"I4cfBoRWEhB90HBdjh8z5Q","business_id":"Ld88I1LFRlxnFlQVIoHAJw","stars":5.0,"useful":2,"funny":2,"cool":1,"text":"Kudos to AutoNation! We had an oil change done at another franchise and found our Toyota leaking oil the next day. We took it back to said business and they came up with all kinds of reasons that they weren't at fault. We brought the car to AutoNation, and in less than an hour we were shown that the first place used the wrong type of oil filter. Bravo! faced with the evidence the first place gave us the refund we requested.\n\nThe indoor theater and popcorn are a nice touch too! :D","date":"2017-08-07 20:49:39"},
{"review_id":"m-9DK7NwYedIPj1RQ_sXdw","user_id":"JuM-lH05m6Ln8OPUTg8p0g","business_id":"H_RM2u1WWGU1HkKZrYq2Ow","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Dont bother going to voodoo, just come here instead. They have such unique flavors and everything is so fresh. Oh, and try their cold brew too!","date":"2016-09-18 17:06:01"},
{"review_id":"gfwRzTeqcgzyKvFnFwU3TQ","user_id":"Sy_D4Tt_XJXSb03UigFZTA","business_id":"EuiU19EjhybpGLXqBzntgw","stars":1.0,"useful":4,"funny":0,"cool":0,"text":"Bummer. I was very disappointed.  So I finally stopped in for take out.  I got the fried haddock sandwich with fries.  The fries were frozen and greasy..  The haddock sandwich was not good.  Tasted  very fishy and frozen.  I had such high hopes their take out would be good.","date":"2012-04-28 11:39:17"},
{"review_id":"P320Yt8vFD3yjI34hq-umg","user_id":"IMfkbLVt_GJfD7zJ9T4fcw","business_id":"VPqWLp9kMiZEbctCebIZUA","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Overall is good, is worth the line up I don't think so, mainly Instagram addict's go here. Believe me the food is great, service is ok, the hype about it I still dont get it.","date":"2018-09-25 03:22:50"},
{"review_id":"U3hsChq7fgOkXpmO2kT40Q","user_id":"XpmQ4Ik5YxckGRfBxeekZA","business_id":"J7KvI94QUxab29LLeG6bew","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"It's a pleasure doing business with them. Very good service and hospitable staff.","date":"2012-07-16 00:34:36"},
{"review_id":"EO5rALvJMkK8QEvUNs1gxg","user_id":"u2xPfv6_wcKt-lW-C1cV8A","business_id":"9P-lp3AWDXGayDqJz9VPwQ","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"The ramen here is less than great. It came out luke warm and oily. The service we received was NOT good. I will not be returning.","date":"2018-02-11 03:30:12"},
{"review_id":"0mOuimxEtWuv63REW07u5g","user_id":"k0d3Jnxulohu1HdJj1Hfkg","business_id":"PYDzfxSLUCCwQysbOkFSVA","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"This a great place to go to be social with a group.  I went yesterday and had to wait in line ten minutes just to get in, but no big deal, as the newest addition to Kendall Square the \"new\" factor of State Park delivers on the hype and is worth the wait!\n\nThe place was packed but it somehow did not feel crowded and while we were only there for drinks I will be back for the southern food. \n\nThe bar tenders kept everyone happy in the crowded restaurant and with good Juke Box tunes, fun shuffle board and great decor all of the ingredients were primed for a fun fueled night. \n\nKudos to the female bartender for making me and my friends 8  Moscow Mules and one great dirty Vodka Martini.  The group all agreed - delicious, 8 for 8! \n\nA raucous good time in the always fun and classy Kendall Square.  If you're bar hopping near Inman and Kendall save yourself the walk to Central and crash the party at State Park.","date":"2014-02-23 22:02:44"},
{"review_id":"PqjcouPGridrxYB5xrYX4Q","user_id":"rb8O5KymPpxL3D43B_7sQw","business_id":"g3pXGPRKYd_WQxLT2IFPxQ","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"I just got done with lunch here. It has been okay in the past, but today, the service was a failure on multiple levels. First, it look a long time for my food to come out, and the waitress initially brought the wrong order. Then, it look 20 minutes before I was able to chase down the waitress to pay my check. Finally, when I received my check, they charged dinner pricing for a lunch. I was running late to get back to the office, so I paid it, but all said, the service was inexcusable. I write in the hopes that you will take corrective action, whether in coaching your staff, or hiring more people for the lunch rush.","date":"2017-11-06 19:27:53"},
{"review_id":"jfbs1wI92Osc1KGQmqC3FQ","user_id":"0mMzTnLxrHfizEIUa7wujw","business_id":"LAhRM37ofCq5f4nCM20aCA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This place has everything-I finally found Dogfish 120m IPA! If they don't have it the store, ask if they have it in the back.","date":"2013-10-24 02:48:36"},
{"review_id":"eiAeuhR3kurAO8rAt_rhlg","user_id":"7zEJt0NVl-lMiMwkCsvteg","business_id":"8zehGz9jnxPqXtOc7KaJxA","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"Brasserie zero zero... we were hoping for a ten based on how highly recommended it was however, we were very disappointed with the quality of the food. We ordered escargot and artichoke to start. Escargot was covered in a bitter green sauce- butter and garlic would have really helped. The artichoke wasn't cooked properly and was minimally seasoned. It was also small portions, about a fourth of an artichoke in size. Even after sending back the artichoke it still was tough and not fully cooked. \n\nWe ordered the lamb chops for our main with a side of mashed potatoes. The potatoes were sour and not as creamy as expected. For $35 we received two lamb chops with a tasty mustard sauce but the accompanying vegetables were tasteless and again, disappointing. The ambiance and service was great and we had a yummy creme brûlée brought to our table for the birthday we were celebrating but we wished the rest of the meal had lived up to the hype.","date":"2018-08-04 20:52:32"},
{"review_id":"ljjT3RaKYLWZOwdWB6ApjA","user_id":"njEa-gaTTxMueydgu0gUkg","business_id":"jdAHMkNHejuvOk9vE6wGWA","stars":3.0,"useful":1,"funny":0,"cool":0,"text":"Bummer that the price for a ticket to the hotel was the same price as a rental car.  It was an ok ride but we should have just gotten a car.\n\nAlso, you need to walk way down from the desk to the waiting area to catch the shuttle.  Good thing we traveled light.\n\nLesson-ed learned for next time.","date":"2017-02-09 06:23:25"},
{"review_id":"z-6ElnK3yXpn2oNKR7NYtw","user_id":"OSsqq7CzBdAbF7E6kZHd0g","business_id":"bZiIIUcpgxh8mpKMDhdqbA","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"My husband and I shared the parmesan truffly fries. They were pretty good and plentiful. Two to three can definitely share. I'm a vegetarian and was going to order the La Bandita. However, the waitress suggested the goodnight burger with a veggie patty. It sounded great so I opted to try it. After all, this was my first visit to a Hopdoddy and she would know better than I would. Despite the different elements, the burger to me was very bland. The patty didn't have much flavor and there wasn't much sauce. (When the waitress pitched the burger, she said it have more flavor than the La Bandita because of the sauce. Since I'm all about the sauce, it helped to sell me on this burger.) \n\nJust a note on the Impossible burger: I'm a vegetarian that does not miss meat or the flavor of meat. Because this burger tries to replicate the texture and flavor or meat, it really turned me off.\n\nMy husband went with the classic and added bacon and cheese. The burger arrived with only cheese (no bacon). He said it was alright but he didn't rave about it in a way that told me he was in love with it.\n\nWe ordered a banana shake that was one of their feature items. It wasn't as thick and not ice cold as we would expect for a shake. It was much closer to room temperature and had a thin consistency.\n\nWould I go back? Maybe. I would definitely try the La Bandita to give that burger a shot. A quick note about the line: it moved pretty quickly. Once we got inside, a couple of spots opened up at the bar and the waitress invited us over to sit there. We jumped at the opportunity and saved about another 10 minutes in line.","date":"2017-10-11 00:25:47"},
{"review_id":"oL2y3mXe_qab349DPW6uZg","user_id":"4cDqW9sWnZ57tsIEiElJWw","business_id":"0nMbLN0B5I-2tNnQLSo86w","stars":5.0,"useful":4,"funny":4,"cool":4,"text":"\"Even the mad Captain Ahab is touched by Starbuck's goodness...\"\n  Herman Melville \n\nThe drive-thru was jammed with vehicles when I pulled up, so I opted to park and go to the walk-up window. \n\nThe staff were super friendly! More then a few of them said hello to me while I ordered. Even though they were busy, they were all genuinely smiling. They look like they enjoy their job. Great teamwork! \nI think this is the friendliest Starbucks I've ever visited. \n\nThe building is architecturally pleasing to me so it catches my eye every time I've driven past it. I'm glad I stopped this time.\n\nIt's close to my freeway entrance so I'll be making this a regular stop from now on. If you're in the area, you should too!","date":"2017-12-02 19:41:59"},
{"review_id":"DS4kN9ph17evKTUu0I3heQ","user_id":"1hrlsEQ8l43jK4aXqQknGg","business_id":"wVlxPWwFL-MrzCXim-UfWg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We had lunch there on a Sunday afternoon and it was great.  We ordered 2 gluten free pizzas and both were uniquely delicious!  The service was great and it was an overall fantastic experience.  Will definitely be back.","date":"2018-05-08 17:14:19"},
{"review_id":"SBqEC7ZIpK_M4A80BbFa-A","user_id":"hkSfv5w-ZyyQiFSWDbHh4g","business_id":"ZX6v0viDJtr_fP7Mt3Gczg","stars":3.0,"useful":3,"funny":1,"cool":0,"text":"Overall can be a great experience if you're a regular and know what you are doing. You pick your car, get in, and you go. However for the rest of us like myself with family in toll, don't expect much customer assistance. Upon arriving to the National garage at MCO, we did not see anyone in the attendant booth so we proceeded to \"choosing our car\" (I am an Emerald's Club member so we got to pick any car from the respective lane). The caveat is I had a car seat reserved as well for my little one. After we chose our car and had my family inside our chosen vehicle (garage is located outdoors and it's FL) I proceeded to head back to the attendant's help for the car seat. Still no attendant, waited another 10 min before someone showed up. When he finally came back, no personal greetings and was a bit short when I asked about the car seat, he pointed to a pile of car seats on a shelf and walked away. Forget about any type of help with installation. Can be a bit tricky inside a covered garage (dark), an unfamiliar car seat, toddler crawling around the car and did I mention the FL weather...\n\nThe return was a breeze, you proceed to the designated lane and grab your stuff to go. The rep will hand you a receipt and you walk to the terminal.","date":"2017-05-13 09:06:55"},
{"review_id":"0-puCb5vqg9jXOdQi8t4-Q","user_id":"pFqung1h3Kl5NBpGt95Zog","business_id":"avhO2gx4ensf6Su6ld9d5g","stars":2.0,"useful":0,"funny":1,"cool":0,"text":"For the price we paid (about $50 for 2 people) the food was only so-so and the service was AWFUL. Our waitress sounded like a robot, and we had to grab another waiter several times because she never came back to check on us. The food came out and it looked like it had been sitting in the back a while, it was barely warm and a film had formed over the top of my ravioli. Overall, very unimpressed and I don't think I would go back or recommend this location to a friend.","date":"2012-01-03 15:09:23"},
{"review_id":"n2RYgJE9_t8NbON1A-BtPQ","user_id":"hGNAQaGLZrTyMJKPs9CSrg","business_id":"0TU09h0pr6Jfd2VBorDAbw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Amazing Service!!! Very professional & courteous staff!! The best way to deliver excellent customer service is by following up with your customers and keeping your word helping them.\nTine Hopson and Stephen Cimino provided excellent customer service by following up with me all the time and keeping their word :)  Thank you both of you being so awesome!!!","date":"2017-03-03 18:26:13"},
{"review_id":"UQKm8EEKxHeigvd1bYcV-Q","user_id":"vikyvfRREkyvIFg1wtxk1g","business_id":"ARDNlZlbB1c3F-Qvk3lJXQ","stars":5.0,"useful":3,"funny":2,"cool":3,"text":"Seriously, why aren't you at Comfort?\n\nTonight was a special occasion, and we wanted to try something new.  Yelp led us to Comfort.   So worth it!\n\nThis is a new place, and I guess Watertown is giving them a hard time about signs, as they don't have one yet.  To get there, find the Persian restaurant below and head up the stairs.\n\nThere's a small bar (with a large TV) that opens into a lovely, warm dining room.  The ceiling is high and sloped, the exposed brick adorned with a small, gold threaded tapestry.  We were the only ones there, and got to sit by the window.\n\nWe were served by the owner, who was super nice and very attentive.  He really cared that we enjoyed our food, and seemed like an all around nice guy.\n\nI tried the mac and cheese, which was rich, flavorful and wonderful.  The green beans that accompanied it were cooked and seasoned well.  My cohort ordered buffalo wings and a salad.  I was able to try the latter, and was impressed at how fresh everything was.  He enjoyed his wings, which says a lot as he's from Buffalo and is impossible to please when it comes to these things.  I was able to sample the blue cheese that came with the wings and was really impressed.  It wasn't just blue cheese - I could distinctly taste gorgonzola in there.  I asked the owner about it, and he confirmed it.  He then added that pretty much everything (including said dressing) was made on site.  That says a lot, if you ask me.\n\nOh, and I'd like to thank the bartender for leaving off the sugar on my martini glass.  Sugar is like an unnecessary set of very sticky training wheels.  Three cheers for a decent lemon martini.\n\nWe were the only ones in the dining room tonight.  Don't get me wrong, I loved the privacy and quiet of the empty room, but something tells me Comfort shouldn't remain a secret.  Get thee to Comfort.  And while you're at it, bring me back some of that blue cheese \/ gorgonzola yumminess.","date":"2008-04-30 01:39:05"},
{"review_id":"q8QIZqcW4MgpeArSFs7iHw","user_id":"KutLfzMaUqwdWMyMAM28rA","business_id":"JO4tK5oH6ncQ5m_MqkwxVQ","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Fix the Beer.  The hardware is the problem. At least 15 out of the 45 taps are faulty.  Sorry guys, but I have given you 5 years and other customers will notice, Please Scott.","date":"2018-04-15 08:49:03"},
{"review_id":"J4LVJg82TjwJmjJvwwJcOg","user_id":"EdJoFvhyRQnnGW7DT3ZLQA","business_id":"HUEZLPIM64cDZnfHE1H3AA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"its the best pizza hut i'v found in florida always got great deals & offers the staff are very friendly & make you feel welcome and if you have children with you they make them feel extra special & welcome them in a huge way too","date":"2008-09-29 09:33:04"},
{"review_id":"xgB4nPkOmU8putxeM8VabA","user_id":"LO4PvX9Pr8re9kQEQjj0CA","business_id":"r1vkjKMksmHhE9SjvSAdaw","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"certainly don't come here for the ambiance. it appears like it used to be a walk-up ice cream window in the front, which is semi-camouflaged with curtains. the service is okay - efficient, but not overly friendly or helpful. we mostly stick to the curries here, which are good. often filled with a lot of tufts students during the school year, probably b\/c it is not so crowded and can accommodate larger groups.\n\nsometimes one of the employees (or their family members) are playing an electronic keyboard.","date":"2010-05-14 22:50:31"}
]
